DATA ENCODING

1. NOMINAL ENCODING / ONE HOT ENCODING

In [14]:
import seaborn as sns
import numpy as np 
import pandas as pd
df = sns.load_dataset('tips')

In [7]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [8]:
# day column er encoding korbo 
# day -> non order -> nomincal encoding 
# one hot encoding

In [9]:
# librarie import 
from sklearn.preprocessing import OneHotEncoder

In [10]:
# ovject creation 
encoder = OneHotEncoder()

In [16]:
pd.Categorical(df['day'])

['Sun', 'Sun', 'Sun', 'Sun', 'Sun', ..., 'Sat', 'Sat', 'Sat', 'Sat', 'Thur']
Length: 244
Categories (4, object): ['Thur', 'Fri', 'Sat', 'Sun']

In [17]:
# fir and transfrom to numericak value 
encoded_arr = encoder.fit_transform(df[['day']]).toarray()
# alphabatically feature add korbe 
# sparce matrix return korey 
# tai convert it to array

In [19]:
# convert it to dataframe 
df1 = pd.DataFrame(encoded_arr,columns=encoder.get_feature_names_out())

In [21]:
# concat df adn df1 with column wise 
pd.concat([df,df1] , axis=1)

,total_bill,tip,sex,smoker,day,time,size,day_Fri,day_Sat,day_Sun,day_Thur
0,16.99,1.01,Female,No,Sun,Dinner,2,0.0,0.0,1.0,0.0
1,10.34,1.66,Male,No,Sun,Dinner,3,0.0,0.0,1.0,0.0
2,21.01,3.50,Male,No,Sun,Dinner,3,0.0,0.0,1.0,0.0
3,23.68,3.31,Male,No,Sun,Dinner,2,0.0,0.0,1.0,0.0
4,24.59,3.61,Female,No,Sun,Dinner,4,0.0,0.0,1.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,0.0,1.0,0.0,0.0
240,27.18,2.00,Female,Yes,Sat,Dinner,2,0.0,1.0,0.0,0.0
241,22.67,2.00,Male,Yes,Sat,Dinner,2,0.0,1.0,0.0,0.0
242,17.82,1.75,Male,No,Sat,Dinner,2,0.0,1.0,0.0,0.0
243,18.78,3.00,Female,No,Thur,Dinner,2,0.0,0.0,0.0,1.0

In [23]:
#example 2 
df = pd.DataFrame({'color':['red','blue','green','green','red','blue']})

In [24]:
df

   color
0    red
1   blue
2  green
3  green
4    red
5   blue

In [27]:
from sklearn.preprocessing import OneHotEncoder
encoder = OneHotEncoder()
encoded_Arr = encoder.fit_transform(df[['color']]).toarray()

In [30]:
df1 = pd.DataFrame(encoded_Arr,columns=encoder.get_feature_names_out())
df1

   color_blue  color_green  color_red
0         0.0          0.0        1.0
1         1.0          0.0        0.0
2         0.0          1.0        0.0
3         0.0          1.0        0.0
4         0.0          0.0        1.0
5         1.0          0.0        0.0

In [31]:
pd.concat([df,df1],axis=1)

   color  color_blue  color_green  color_red
0    red         0.0          0.0        1.0
1   blue         1.0          0.0        0.0
2  green         0.0          1.0        0.0
3  green         0.0          1.0        0.0
4    red         0.0          0.0        1.0
5   blue         1.0          0.0        0.0

ORDINAL ENCODING

In [33]:
# label encoding 
df = pd.DataFrame({'size':['small','medium','large','medium','large','small']})
df

     size
0   small
1  medium
2   large
3  medium
4   large
5   small

In [34]:
# cat data -> order ache -> label encoding korbo 
from sklearn.preprocessing import LabelEncoder

In [35]:
# object create 
encoder = LabelEncoder()

In [39]:
# fit and transform 
encoded_arr = encoder.fit_transform(df['size'])
# ekhane alphabatic order onujai value assign korbe

In [42]:
encoded_arr

array([2, 1, 0, 1, 0, 2])

In [43]:
df1 = pd.DataFrame(encoded_arr,columns=['encoded_size'])

In [44]:
pd.concat([df,df1] , axis=1)

     size  encoded_size
0   small             2
1  medium             1
2   large             0
3  medium             1
4   large             0
5   small             2

In [45]:
# odinal encoding -> manually order ditey pari 
from sklearn.preprocessing import OrdinalEncoder

In [46]:
df

     size
0   small
1  medium
2   large
3  medium
4   large
5   small

In [53]:
# object create korar somoi order debo 
encoder = OrdinalEncoder(categories=[['small','medium','large']])

In [54]:
encoder.fit_transform(df[['size']])

array([[0.],
       [1.],
       [2.],
       [1.],
       [2.],
       [0.]])

3. TARGET GUIDED ORDINAL ENCODING

In [56]:
df = pd.DataFrame({'city':['new york','london','paris','tokyo','new york','paris'],
              'price':[200,150,300,150,180,320]})
df

       city  price
0  new york    200
1    london    150
2     paris    300
3     tokyo    150
4  new york    180
5     paris    320

In [62]:
# ekhane target er je mean/median ache seta assign korbo 
encoded_dict = df.groupby('city')['price'].mean().to_dict()

In [63]:
# new column create korbo jekhane mean dara map korbo
df['encoded_city'] = df['city'].map(encoded_dict)

In [64]:
df

       city  price  encoded_city
0  new york    200         190.0
1    london    150         150.0
2     paris    300         310.0
3     tokyo    150         150.0
4  new york    180         190.0
5     paris    320         310.0